import random

def Гра(кількість_спроб, випадкове_число):
    for спроба in range(кількість_спроб):
        print("Введіть будь ласка число від 1 до 10:")
        користувацьке_число = int(input("Введіть число: "))
        if користувацьке_число < випадкове_число:
            print("Переможне число більше")
        elif користувацьке_число > випадкове_число:
            print("Переможне число менше")
        elif користувацьке_число == випадкове_число:
            print("Ви виграли!")
            return 0
        else:
            continue
    print("Ви програли")
    print(f"Переможне число: {випадкове_число}")

випадкове_число = random.randrange(1, 10)
кількість_спроб = int(input("Скільки ви хочете спроб:"))
Гра(кількість_спроб, випадкове_число)
